{
    "title": "Accessible Astro Starter",
    "description": "An Accessible Starter Theme for Astro including accessiblity features such as landmarks, better focus-outline and skip-links navigation.",
    "fullDescription": "<p>The Accessible Astro Starter is designed to help you build your project faster and provide a solid base for accessibility!</p><p>The theme includes some dedicated accessible components (such as a keyboard accessible and responsive navigation) and several components provided by the Accessible Astro Components package.</p><p>The theme also includes example pages, a blog with dynamic routes, a custom 404 page and many Design System utility classes, patterns and primitives (such as grids, buttons, lists, spacings, sizes and more).</p><h2>Accessibility features</h2><ul><li>Semantic HTML and accessible landmarks</li><li>Outline focus indicator which works on dark and light backgrounds</li><li>ARIA attributes which provide a better experience for screen reader users</li><li>Visually hidden \"Skip to content\" link</li><li>Navigation menu with full keyboard support and accessible mobile navigation</li><li>Dark mode support with a user toggle and default support for a user's preferred color scheme</li><li>Breadcrumbs, pagination, header, and footer components</li><li>Automatically disables animations for users that have this preference turned on</li></ul><h2>Extra features</h2><ul><li>SEO Component for setting page-specific metadata</li><li>Preconfigured with dynamic routes for a basic blog, with breadcrumbs and pagination</li><li>Custom 404 error page which you can adjust to your needs</li><li><a href=\"https://github.com/markteekman/accessible-astro-components\">Accessible Astro Components</a> package comes preinstalled with extra components such as Accordions, Modals and Notifications</li><li>The&nbsp;<a href=\"https://github.com/natemoo-re/astro-icon\">Astro Icon</a> package is also preinstalled which can be applied to different use cases</li></ul>",
    "image": "./images/accessible-astro-starter.png",
    "images": [
        "./images/accessible-astro-starter-2.png",
        "./images/accessible-astro-starter-3.png",
        "./images/accessible-astro-starter-4.png"
    ],
    "repoUrl": "https://github.com/markteekman/accessible-astro-starter",
    "demoUrl": "https://starter.accessible-astro.dev/",
    "categories": ["blog"],
    "tags": ["sass"],
    "keywords": ["a11y", "blog", "darkmode"],
    "links": [
        { "text": "Documentation", "href": "https://accessible-astro.dev/" },
        { "text": "Accessible Astro Dashboard", "href": "https://github.com/markteekman/accessible-astro-dashboard/" },
        { "text": "Accessible Astro Components", "href": "https://github.com/markteekman/accessible-astro-components/" }
    ],
    "featured": 8
}
