{
    "title": "Accessible Astro Starter",
    "description": "An Accessible Starter Theme for Astro including accessiblity features such as landmarks, better focus-outline and skip-links navigation.",
    "fullDescription": "The Accessible Astro Starter is designed to help you build your project faster and provide a solid base for accessibility! The theme includes some dedicated accessible components (such as a keyboard accessible and responsive navigation) and several components provided by the Accessible Astro Components package. The theme also includes example pages, a blog with dynamic routes, a custom 404 page and many Design System utility classes, patterns and primitives (such as grids, buttons, lists, spacings, sizes and more).\n\n## Accessibility features\n\n- Accessible landmarks such as `header`, `main`, `footer`, `section` and `nav`\n- Outline focus indicator which works on dark and light backgrounds\n- Several `aria` attributes which provide a better experience for screen reader users\n- `SkipLinks.astro` component to skip to either the main menu or the main content\n- `Navigation.astro` component with keyboard accessible (dropdown) navigation (arrow keys, escape key)\n- `ResponsiveToggle.astro` component with an accessible responsive toggle button for the mobile navigation\n- DarkMode.astro component toggle with accessible button and a user system preferred color scheme\n- Breadcrumbs.astro component provides a way to navigate the blog posts\n- Pagination.astro component provides another way to navigate the blog posts\n- Header.astro component included in the DefaultLayout.astro layout\n- Footer.astro component included in the DefaultLayout.astro layout\n- .sr-only utility class for screen reader only text content (hides text visually)\n- prefers-reduced-motion disables animations for users that have this preference turned on\n\n## Extra features\n\n- `SiteMeta.astro` SEO component for setting custom meta deta on different pages\n- `[...page].astro` and `[post].astro` demonstrate the use of dynamic routes and provide a basic blog with breadcrumbs and pagination\n- `404.astro` provides a custom 404 error page which you can adjust to your needs\n- [Accessible Astro Components](https://github.com/markteekman/accessible-astro-components) package comes preinstalled with extra components such as Accordions, Modals and Notifications\n- Nate Moore's awesome [Astro Icon](https://github.com/natemoo-re/astro-icon) package is also preinstalled which can be applied to different use cases",
    "image": "./images/accessible-astro-starter.png",
    "repoUrl": "https://github.com/markteekman/accessible-astro-starter",
    "demoUrl": "https://starter.accessible-astro.dev/",
    "categories": ["blog"],
    "tags": ["sass"],
    "keywords": ["a11y", "blog", "darkmode"],
    "links": [
        { "text": "Documentation", "href": "https://accessible-astro.dev/" },
        { "text": "Accessible Astro Dashboard", "href": "https://github.com/markteekman/accessible-astro-dashboard/" },
        { "text": "Accessible Astro Components", "href": "https://github.com/markteekman/accessible-astro-components/" }
    ],
    "featured": 6
}
